app/views/professors/_form.html.erb

SELECT "expertises".* FROM "expertises"
---
    <%= f.label "Area of Expertise" %><br />
    <%= f.collection_check_boxes :expertise_ids, Expertise.all, :id, :name do |b| %>