app/views/professors/index.html.erb

SELECT "expertises".* FROM "expertises" INNER JOIN "expertises_professors" ON "expertises"."id" = "expertises_professors"."expertise_id" WHERE "expertises_professors"."professor_id" = $1  [["professor_id", 2]]
---
        <td><%= professor.name %></td>
        <td><%= professor.expertises.map(&:name).sort.join(", ") %></td>