app/controllers/professors_controller.rb

  def create
    @professor = Professor.new(professor_params)

    respond_to do |format|
      if @professor.save
---
INSERT INTO "professors" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Jane"], ["created_at", "2016-07-23 04:07:21.660291"], ["updated_at", "2016-07-23 04:07:21.660291"]]